In [2]:
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","hyderabad"],
    "temperature":[80,60,72],
    "humidity":[80,60,70]
})
india_weather

        city  temperature  humidity
0     mumbai           80        80
1      delhi           60        60
2  hyderabad           72        70

In [3]:
us_weather=pd.DataFrame({
    "city":["la","sa","sanant"],
    "temperature":[80,60,72],
    "humidity":[80,60,70]
})
us_weather

     city  temperature  humidity
0      la           80        80
1      sa           60        60
2  sanant           72        70

In [5]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           80        80
1      delhi           60        60
2  hyderabad           72        70
3         la           80        80
4         sa           60        60
5     sanant           72        70

In [6]:
df=pd.concat([india_weather,us_weather],keys=["india","us"])
df

              city  temperature  humidity
india 0     mumbai           80        80
      1      delhi           60        60
      2  hyderabad           72        70
us    0         la           80        80
      1         sa           60        60
      2     sanant           72        70

In [7]:
df.loc['india']

        city  temperature  humidity
0     mumbai           80        80
1      delhi           60        60
2  hyderabad           72        70

In [9]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","hyderabad"],
    "temperature":[80,60,72]
},index=[0,1,2])
temperature_df

        city  temperature
0     mumbai           80
1      delhi           60
2  hyderabad           72

In [14]:
windspeed_df=pd.DataFrame({
    "city":["delhi","mumbai","hyderabad"],
    "winspeed":[80,60,72]
},index=[1,0,2])            # to align rows
windspeed_df

        city  winspeed
1      delhi        80
0     mumbai        60
2  hyderabad        72

In [15]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature       city  winspeed
0     mumbai           80     mumbai        60
1      delhi           60      delhi        80
2  hyderabad           72  hyderabad        72

In [17]:
s=pd.Series(["humid","dry","rain"],name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [18]:
df=pd.concat([temperature_df,s],axis=1)
df

        city  temperature  event
0     mumbai           80  humid
1      delhi           60    dry
2  hyderabad           72   rain